Dlubal.RFEM5.AngularDimension
Angular dimension parameters

Dlubal.RFEM5.AngularDimension.No
Number

Dlubal.RFEM5.AngularDimension.ID
Identifier

Dlubal.RFEM5.AngularDimension.Tag
Tag

Dlubal.RFEM5.AngularDimension.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.AngularDimension.ReferenceObjectType
Type of reference object

Dlubal.RFEM5.AngularDimension.ReferenceObjectNo
Number of reference object (node, line, member or surface)

Dlubal.RFEM5.AngularDimension.ObjectType
Type of dimension objects

Dlubal.RFEM5.AngularDimension.ObjectList
List of dimension objects (nodes, lines, members or surfaces)

Dlubal.RFEM5.AngularDimension.Placement
Placement of angular dimension

Dlubal.RFEM5.AngularDimension.Offset
Offset

Dlubal.RFEM5.AngularDimension.AngleGreater180
Angle is greater than 180°

Dlubal.RFEM5.AngularDimension.Angles
Array of angles (read only)

Dlubal.RFEM5.AngularDimension.Symbol
Symbol